qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/SetIPv6PppoeSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<SetIPv6PppoeSettings xmlns="http://purenetworks.com/HNAP1/">
			<IPv6_ConnectionType></IPv6_ConnectionType>
			<IPv6_PppoeNewSession></IPv6_PppoeNewSession>
			<IPv6_PppoeType></IPv6_PppoeType>
			<IPv6_PppoeStaticIp></IPv6_PppoeStaticIp>
			<IPv6_PppoeUsername></IPv6_PppoeUsername>
			<IPv6_PppoePassword></IPv6_PppoePassword>
			<IPv6_PppoeReconnectMode></IPv6_PppoeReconnectMode>
			<IPv6_PppoeMaxIdleTime></IPv6_PppoeMaxIdleTime>
			<IPv6_PppoeMTU></IPv6_PppoeMTU>
			<IPv6_PppoeServiceName></IPv6_PppoeServiceName>
			<IPv6_ObtainDNS></IPv6_ObtainDNS>
			<IPv6_PrimaryDNS></IPv6_PrimaryDNS>
			<IPv6_SecondaryDNS></IPv6_SecondaryDNS>
			<IPv6_DhcpPd></IPv6_DhcpPd>
			<IPv6_LanAddress></IPv6_LanAddress>
			<IPv6_LanIPv6AddressAutoAssignment></IPv6_LanIPv6AddressAutoAssignment>
			<IPv6_LanAutomaticDhcpPd></IPv6_LanAutomaticDhcpPd>
			<IPv6_LanAutoConfigurationType></IPv6_LanAutoConfigurationType>
			<IPv6_LanRouterAdvertisementLifeTime></IPv6_LanRouterAdvertisementLifeTime>
			<IPv6_LanIPv6AddressRangeStart></IPv6_LanIPv6AddressRangeStart>
			<IPv6_LanIPv6AddressRangeEnd></IPv6_LanIPv6AddressRangeEnd>
			<IPv6_LanDhcpLifeTime></IPv6_LanDhcpLifeTime>
		</SetIPv6PppoeSettings>
	</soap:Body>
</soap:Envelope>